author: Tobias Michalski (Nextron Systems), David Bertho (@dbertho) & Eirik Sveen
  (@0xSV1), Storebrand
date: 2021-06-10
description: "Detects potential persistence activity via outlook today page.\nAn attacker
  can set a custom page to execute arbitrary code and link to it via the registry
  values \"URL\" and \"UserDefinedUrl\".\n"
detection:
  condition: selection_main and 1 of selection_value_* and not 1 of filter_main_*
  filter_main_office:
    Image|endswith: \OfficeClickToRun.exe
    Image|startswith:
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\
  selection_main:
    TargetObject|contains|all:
    - Software\Microsoft\Office\
    - \Outlook\Today\
  selection_value_stamp:
    Details: DWORD (0x00000001)
    TargetObject|endswith: \Stamp
  selection_value_url:
    TargetObject|endswith:
    - \URL
    - \UserDefinedUrl
falsepositives:
- Unknown
id: 487bb375-12ef-41f6-baae-c6a1572b4dd1
level: high
logsource:
  category: registry_set
  product: windows
modified: 2024-08-07
references:
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=74
- https://trustedsec.com/blog/specula-turning-outlook-into-a-c2-with-one-registry-change
related:
- id: ddd171b5-2cc6-4975-9e78-f0eccd08cc76
  type: similar
status: test
tags:
- attack.persistence
- attack.t1112
title: Potential Persistence Via Outlook Today Page
