author: Nasreddine Bencherchali (Nextron Systems)
date: 2024-07-05
description: "Detects changes to the \"DisableHypervisorEnforcedPagingTranslation\"\
  \ registry value. Where the it is set to \"1\" in order to disable the Hypervisor
  Enforced Paging Translation feature.\n"
detection:
  condition: selection
  selection:
    Details: DWORD (0x00000001)
    TargetObject|endswith: \DisableHypervisorEnforcedPagingTranslation
falsepositives:
- Unknown
id: 7f2954d2-99c2-4d42-a065-ca36740f187b
level: high
logsource:
  category: registry_set
  product: windows
references:
- https://twitter.com/standa_t/status/1808868985678803222
- https://github.com/AaLl86/WindowsInternals/blob/070dc4f317726dfb6ffd2b7a7c121a33a8659b5e/Slides/Hypervisor-enforced%20Paging%20Translation%20-%20The%20end%20of%20non%20data-driven%20Kernel%20Exploits%20(Recon2024).pdf
status: experimental
tags:
- attack.defense-evasion
- attack.t1562.001
title: Hypervisor Enforced Paging Translation Disabled
