author: '@kostastsale, Nasreddine Bencherchali (Nextron Systems)'
date: 2023-11-05
description: "Detects activity that indicates a user disabling the ability for Antivirus
  mini filter to inspect a \"Dev Drive\".\n"
detection:
  condition: selection
  selection:
    Details: DWORD (0x00000000)
    TargetObject|endswith: \FilterManager\FltmgrDevDriveAllowAntivirusFilter
falsepositives:
- Unlikely
id: 31e124fb-5dc4-42a0-83b3-44a69c77b271
level: high
logsource:
  category: registry_set
  product: windows
modified: 2024-08-16
references:
- https://twitter.com/0gtweet/status/1720419490519752955
status: experimental
tags:
- attack.defense-evasion
- attack.t1562.001
title: Antivirus Filter Driver Disallowed On Dev Drive - Registry
