author: Nasreddine Bencherchali (Nextron Systems), @Kostastsale
date: 2024-08-23
description: "Detects changes to the registry value \"PythonFunctionWarnings\" that
  would prevent any warnings or alerts from showing when Python functions are about
  to be executed.\nThreat actors could run malicious code through the new Microsoft
  Excel feature that allows Python to run within the spreadsheet.\n"
detection:
  condition: selection
  selection:
    Details: DWORD (0x00000001)
    TargetObject|contains: \Microsoft\Office\
    TargetObject|endswith: \Excel\Security\PythonFunctionWarnings
falsepositives:
- Unknown
id: 17e53739-a1fc-4a62-b1b9-87711c2d5e44
level: high
logsource:
  category: registry_set
  product: windows
references:
- https://support.microsoft.com/en-us/office/data-security-and-python-in-excel-33cc88a4-4a87-485e-9ff9-f35958278327
related:
- id: 023c654f-8f16-44d9-bb2b-00ff36a62af9
  type: similar
status: test
tags:
- attack.defense-evasion
- attack.t1562.001
title: Python Function Execution Security Warning Disabled In Excel - Registry
