author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2019-08-25
description: "Detects potential malicious modification of the property value of IsCredGuardEnabled
  from\nHKLM:\\SYSTEM\\CurrentControlSet\\Control\\SecurityProviders\\WDigest to disable
  Cred Guard on a system.\nThis is usually used with UseLogonCredential to manipulate
  the caching credentials.\n"
detection:
  condition: selection
  selection:
    TargetObject|endswith: \IsCredGuardEnabled
falsepositives:
- Unknown
id: 1a2d6c47-75b0-45bd-b133-2c0be75349fd
level: high
logsource:
  category: registry_event
  product: windows
modified: 2021-11-27
references:
- https://teamhydra.blog/2020/08/25/bypassing-credential-guard/
status: test
tags:
- attack.defense-evasion
- attack.t1112
title: Wdigest CredGuard Registry Modification
